/* 
    解构赋值是对赋值运算符的扩展

    ES6 添加的

    他是一种针对数组或者对象进行模式匹配，然后对其中的变量进行赋值
*/

////////////////////////////////////////////////
//               数组模型的结构
////////////////////////////////////////////////

// 基本
let [a1, b1, c1] = [1, 2, 3];
console.log(a1); // 1
console.log(b1); // 2
console.log(c1); // 3

// 剩余运算符
let [a2, ...b2] = [1, 2, 3, 4];
console.log(a2); // 1
console.log(b2); // [2, 3, 4]

// 字符串等
let [a3, b3, c3] = "hello";
console.log(a3); // h
console.log(b3); // e
console.log(c3); // l

////////////////////////////////////////////////
//              对象模型的结构
////////////////////////////////////////////////

// 基本
let { foo, bar } = { foo: 'aaa', bar: 'bbb' };
// foo = 'aaa'
// bar = 'bbb'

// 剩余运算符
let { a, b, ...c } = { a: 10, b: 20, c: 30, d: 40, e: 50 };
// a = 10
// b = 20
// c = { c: 30, d: 40, e: 50 }